examples/examples/outputs/combined-graph.mmd
graph TD
  akramkhan["Akram Khan"]
  alvinailey["Alvin Ailey"]
  christopherwheeldon["Christopher Wheeldon"]
  crystalpite["Crystal Pite"]
  georgebalanchine["George Balanchine"]
  isadoraduncan["Isadora Duncan"]
  jeromerobbins["Jerome Robbins"]
  marthagraham["Martha Graham"]
  mercecunningham["Merce Cunningham"]
  pinabausch["Pina Bausch"]
  twylatharp["Twyla Tharp"]
  williamforsythe["William Forsythe"]
  anger["Anger"]
  anxiety["Anxiety"]
  compassion["Compassion"]
  curiosity["Curiosity"]
  excitement["Excitement"]
  fear["Fear"]
  gratitude["Gratitude"]
  hope["Hope"]
  joy["Joy"]
  love["Love"]
  sadness["Sadness"]
  shame["Shame"]

  akramkhan --> marthagraham
  akramkhan --> pinabausch
  akramkhan --> williamforsythe
  akramkhan --> crystalpite
  alvinailey --> marthagraham
  christopherwheeldon --> georgebalanchine
  christopherwheeldon --> jeromerobbins
  christopherwheeldon --> twylatharp
  crystalpite --> williamforsythe
  crystalpite --> pinabausch
  crystalpite --> akramkhan
  georgebalanchine --> jeromerobbins
  georgebalanchine --> christopherwheeldon
  isadoraduncan --> marthagraham
  isadoraduncan --> alvinailey
  isadoraduncan --> mercecunningham
  jeromerobbins --> georgebalanchine
  jeromerobbins --> marthagraham
  jeromerobbins --> twylatharp
  jeromerobbins --> christopherwheeldon
  marthagraham --> isadoraduncan
  marthagraham --> mercecunningham
  marthagraham --> jeromerobbins
  marthagraham --> twylatharp
  mercecunningham --> marthagraham
  mercecunningham --> williamforsythe
  pinabausch --> akramkhan
  pinabausch --> crystalpite
  pinabausch --> williamforsythe
  twylatharp --> marthagraham
  twylatharp --> mercecunningham
  twylatharp --> jeromerobbins
  twylatharp --> georgebalanchine
  twylatharp --> christopherwheeldon
  williamforsythe --> georgebalanchine
  williamforsythe --> mercecunningham
  williamforsythe --> pinabausch
  williamforsythe --> crystalpite
  williamforsythe --> akramkhan
  anger --> fear
  anger --> shame
  anger --> compassion
  anger --> anxiety
  anxiety --> fear
  anxiety --> anger
  anxiety --> sadness
  anxiety --> shame
  compassion --> love
  compassion --> shame
  compassion --> anger
  curiosity --> excitement
  curiosity --> fear
  excitement --> joy
  excitement --> curiosity
  fear --> anxiety
  gratitude --> joy
  gratitude --> love
  gratitude --> anxiety
  gratitude --> hope
  hope --> sadness
  hope --> fear
  hope --> joy
  joy --> excitement
  joy --> sadness
  joy --> gratitude
  love --> compassion
  love --> joy
  love --> gratitude
  sadness --> anger
  sadness --> hope
  shame --> anger
  shame --> anxiety
  marthagraham -.-> akramkhan
  marthagraham -.-> alvinailey
  georgebalanchine -.-> twylatharp
  georgebalanchine -.-> williamforsythe
  alvinailey -.-> isadoraduncan
  mercecunningham -.-> isadoraduncan
  mercecunningham -.-> twylatharp
  fear -.-> anger
  fear -.-> curiosity
  fear -.-> hope
  shame -.-> compassion
  anxiety -.-> gratitude
  anger -.-> sadness
  sadness -.-> anxiety
  sadness -.-> joy
  joy -.-> hope
  joy -.-> love
  hope -.-> gratitude
  akramkhan ==> twylatharp
  twylatharp ==> akramkhan
  akramkhan ==> christopherwheeldon
  christopherwheeldon ==> akramkhan
  akramkhan ==> jeromerobbins
  jeromerobbins ==> akramkhan
  christopherwheeldon ==> crystalpite
  crystalpite ==> christopherwheeldon
  crystalpite ==> jeromerobbins
  jeromerobbins ==> crystalpite
  alvinailey ==> crystalpite
  crystalpite ==> alvinailey
  alvinailey ==> pinabausch
  pinabausch ==> alvinailey
  crystalpite ==> isadoraduncan
  isadoraduncan ==> crystalpite
  isadoraduncan ==> pinabausch
  pinabausch ==> isadoraduncan
  alvinailey ==> excitement
  excitement ==> alvinailey
  christopherwheeldon ==> williamforsythe
  williamforsythe ==> christopherwheeldon
  christopherwheeldon ==> pinabausch
  pinabausch ==> christopherwheeldon
  jeromerobbins ==> pinabausch
  pinabausch ==> jeromerobbins
  anger ==> excitement
  excitement ==> anger
  anger ==> joy
  joy ==> anger
  anxiety ==> hope
  hope ==> anxiety
  compassion ==> sadness
  sadness ==> compassion
  sadness ==> shame
  shame ==> sadness
  excitement ==> gratitude
  gratitude ==> excitement
  excitement ==> hope
  hope ==> excitement
