examples/examples/outputs/emotions-graph.dot
digraph G {
  rankdir=LR;
  node [shape=box, style=rounded];

  "akram-khan" [label="Akram Khan"];
  "alvin-ailey" [label="Alvin Ailey"];
  "christopher-wheeldon" [label="Christopher Wheeldon"];
  "crystal-pite" [label="Crystal Pite"];
  "george-balanchine" [label="George Balanchine"];
  "isadora-duncan" [label="Isadora Duncan"];
  "jerome-robbins" [label="Jerome Robbins"];
  "martha-graham" [label="Martha Graham"];
  "merce-cunningham" [label="Merce Cunningham"];
  "pina-bausch" [label="Pina Bausch"];
  "twyla-tharp" [label="Twyla Tharp"];
  "william-forsythe" [label="William Forsythe"];
  "anger" [label="Anger"];
  "anxiety" [label="Anxiety"];
  "compassion" [label="Compassion"];
  "curiosity" [label="Curiosity"];
  "excitement" [label="Excitement"];
  "fear" [label="Fear"];
  "gratitude" [label="Gratitude"];
  "hope" [label="Hope"];
  "joy" [label="Joy"];
  "love" [label="Love"];
  "sadness" [label="Sadness"];
  "shame" [label="Shame"];

  "akram-khan" -> "martha-graham" [color=blue];
  "akram-khan" -> "pina-bausch" [color=blue];
  "akram-khan" -> "william-forsythe" [color=blue];
  "akram-khan" -> "crystal-pite" [color=blue];
  "alvin-ailey" -> "martha-graham" [color=blue];
  "christopher-wheeldon" -> "george-balanchine" [color=blue];
  "christopher-wheeldon" -> "jerome-robbins" [color=blue];
  "christopher-wheeldon" -> "twyla-tharp" [color=blue];
  "crystal-pite" -> "william-forsythe" [color=blue];
  "crystal-pite" -> "pina-bausch" [color=blue];
  "crystal-pite" -> "akram-khan" [color=blue];
  "george-balanchine" -> "jerome-robbins" [color=blue];
  "george-balanchine" -> "christopher-wheeldon" [color=blue];
  "isadora-duncan" -> "martha-graham" [color=blue];
  "isadora-duncan" -> "alvin-ailey" [color=blue];
  "isadora-duncan" -> "merce-cunningham" [color=blue];
  "jerome-robbins" -> "george-balanchine" [color=blue];
  "jerome-robbins" -> "martha-graham" [color=blue];
  "jerome-robbins" -> "twyla-tharp" [color=blue];
  "jerome-robbins" -> "christopher-wheeldon" [color=blue];
  "martha-graham" -> "isadora-duncan" [color=blue];
  "martha-graham" -> "merce-cunningham" [color=blue];
  "martha-graham" -> "jerome-robbins" [color=blue];
  "martha-graham" -> "twyla-tharp" [color=blue];
  "merce-cunningham" -> "martha-graham" [color=blue];
  "merce-cunningham" -> "william-forsythe" [color=blue];
  "pina-bausch" -> "akram-khan" [color=blue];
  "pina-bausch" -> "crystal-pite" [color=blue];
  "pina-bausch" -> "william-forsythe" [color=blue];
  "twyla-tharp" -> "martha-graham" [color=blue];
  "twyla-tharp" -> "merce-cunningham" [color=blue];
  "twyla-tharp" -> "jerome-robbins" [color=blue];
  "twyla-tharp" -> "george-balanchine" [color=blue];
  "twyla-tharp" -> "christopher-wheeldon" [color=blue];
  "william-forsythe" -> "george-balanchine" [color=blue];
  "william-forsythe" -> "merce-cunningham" [color=blue];
  "william-forsythe" -> "pina-bausch" [color=blue];
  "william-forsythe" -> "crystal-pite" [color=blue];
  "william-forsythe" -> "akram-khan" [color=blue];
  "anger" -> "fear" [color=blue];
  "anger" -> "shame" [color=blue];
  "anger" -> "compassion" [color=blue];
  "anger" -> "anxiety" [color=blue];
  "anxiety" -> "fear" [color=blue];
  "anxiety" -> "anger" [color=blue];
  "anxiety" -> "sadness" [color=blue];
  "anxiety" -> "shame" [color=blue];
  "compassion" -> "love" [color=blue];
  "compassion" -> "shame" [color=blue];
  "compassion" -> "anger" [color=blue];
  "curiosity" -> "excitement" [color=blue];
  "curiosity" -> "fear" [color=blue];
  "excitement" -> "joy" [color=blue];
  "excitement" -> "curiosity" [color=blue];
  "fear" -> "anxiety" [color=blue];
  "gratitude" -> "joy" [color=blue];
  "gratitude" -> "love" [color=blue];
  "gratitude" -> "anxiety" [color=blue];
  "gratitude" -> "hope" [color=blue];
  "hope" -> "sadness" [color=blue];
  "hope" -> "fear" [color=blue];
  "hope" -> "joy" [color=blue];
  "joy" -> "excitement" [color=blue];
  "joy" -> "sadness" [color=blue];
  "joy" -> "gratitude" [color=blue];
  "love" -> "compassion" [color=blue];
  "love" -> "joy" [color=blue];
  "love" -> "gratitude" [color=blue];
  "sadness" -> "anger" [color=blue];
  "sadness" -> "hope" [color=blue];
  "shame" -> "anger" [color=blue];
  "shame" -> "anxiety" [color=blue];
  "martha-graham" -> "akram-khan" [color=red, style=dashed];
  "martha-graham" -> "alvin-ailey" [color=red, style=dashed];
  "george-balanchine" -> "twyla-tharp" [color=red, style=dashed];
  "george-balanchine" -> "william-forsythe" [color=red, style=dashed];
  "alvin-ailey" -> "isadora-duncan" [color=red, style=dashed];
  "merce-cunningham" -> "isadora-duncan" [color=red, style=dashed];
  "merce-cunningham" -> "twyla-tharp" [color=red, style=dashed];
  "fear" -> "anger" [color=red, style=dashed];
  "fear" -> "curiosity" [color=red, style=dashed];
  "fear" -> "hope" [color=red, style=dashed];
  "shame" -> "compassion" [color=red, style=dashed];
  "anxiety" -> "gratitude" [color=red, style=dashed];
  "anger" -> "sadness" [color=red, style=dashed];
  "sadness" -> "anxiety" [color=red, style=dashed];
  "sadness" -> "joy" [color=red, style=dashed];
  "joy" -> "hope" [color=red, style=dashed];
  "joy" -> "love" [color=red, style=dashed];
  "hope" -> "gratitude" [color=red, style=dashed];
  "akram-khan" -> "twyla-tharp" [color=green, style=dotted];
  "twyla-tharp" -> "akram-khan" [color=green, style=dotted];
  "akram-khan" -> "christopher-wheeldon" [color=green, style=dotted];
  "christopher-wheeldon" -> "akram-khan" [color=green, style=dotted];
  "akram-khan" -> "jerome-robbins" [color=green, style=dotted];
  "jerome-robbins" -> "akram-khan" [color=green, style=dotted];
  "christopher-wheeldon" -> "crystal-pite" [color=green, style=dotted];
  "crystal-pite" -> "christopher-wheeldon" [color=green, style=dotted];
  "crystal-pite" -> "jerome-robbins" [color=green, style=dotted];
  "jerome-robbins" -> "crystal-pite" [color=green, style=dotted];
  "alvin-ailey" -> "crystal-pite" [color=green, style=dotted];
  "crystal-pite" -> "alvin-ailey" [color=green, style=dotted];
  "alvin-ailey" -> "pina-bausch" [color=green, style=dotted];
  "pina-bausch" -> "alvin-ailey" [color=green, style=dotted];
  "crystal-pite" -> "isadora-duncan" [color=green, style=dotted];
  "isadora-duncan" -> "crystal-pite" [color=green, style=dotted];
  "isadora-duncan" -> "pina-bausch" [color=green, style=dotted];
  "pina-bausch" -> "isadora-duncan" [color=green, style=dotted];
  "alvin-ailey" -> "excitement" [color=green, style=dotted];
  "excitement" -> "alvin-ailey" [color=green, style=dotted];
  "christopher-wheeldon" -> "william-forsythe" [color=green, style=dotted];
  "william-forsythe" -> "christopher-wheeldon" [color=green, style=dotted];
  "christopher-wheeldon" -> "pina-bausch" [color=green, style=dotted];
  "pina-bausch" -> "christopher-wheeldon" [color=green, style=dotted];
  "jerome-robbins" -> "pina-bausch" [color=green, style=dotted];
  "pina-bausch" -> "jerome-robbins" [color=green, style=dotted];
  "anger" -> "excitement" [color=green, style=dotted];
  "excitement" -> "anger" [color=green, style=dotted];
  "anger" -> "joy" [color=green, style=dotted];
  "joy" -> "anger" [color=green, style=dotted];
  "anxiety" -> "hope" [color=green, style=dotted];
  "hope" -> "anxiety" [color=green, style=dotted];
  "compassion" -> "sadness" [color=green, style=dotted];
  "sadness" -> "compassion" [color=green, style=dotted];
  "sadness" -> "shame" [color=green, style=dotted];
  "shame" -> "sadness" [color=green, style=dotted];
  "excitement" -> "gratitude" [color=green, style=dotted];
  "gratitude" -> "excitement" [color=green, style=dotted];
  "excitement" -> "hope" [color=green, style=dotted];
  "hope" -> "excitement" [color=green, style=dotted];
}
